Tekla Open API Reference for Tekla Structures 2025
ImageItem Properties
The ImageItem type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the image name.
Picture
 Gets or sets the image.
Top
See Also
Reference
ImageItem Class
Tekla.Structures.Dialog.UIControls Namespace